doc/snippet-development.org
#+SETUPFILE: org-setup.inc

#+TITLE: Writing snippets

* Snippet development

** Quickly finding snippets

There are some ways you can quickly find a snippet file or create a new one:

-  =M-x yas-new-snippet=, key binding: =C-c & C-n=

   Creates a new buffer with a template for making a new snippet.  The
   buffer is in =snippet-mode= (see [[snippet-mode][below]]).  When you are done editing
   the new snippet, use [[yas-load-snippet-buffer-and-close][=C-c C-c=]] to save it.

-  =M-x yas-visit-snippet-file=, key binding: =C-c & C-v=

   Prompts you for possible snippet expansions like
   [[sym:yas-insert-snippet][=yas-insert-snippet=]], but instead of expanding it, takes you directly
   to the snippet definition's file, if it exists.

Once you find this file it will be set to =snippet-mode= (see [[snippet-mode][ahead]])
and you can start editing your snippet.

** Using the =snippet-mode= major mode <<snippet-mode>>

There is a major mode =snippet-mode= to edit snippets. You can set the
buffer to this mode with =M-x snippet-mode=. It provides reasonably
useful syntax highlighting.

Three commands are defined in this mode:

-  =M-x yas-load-snippet-buffer=, key binding: =C-c C-l=

   Prompts for a snippet table (with a default based on snippet's
   major mode) and loads the snippet currently being edited.

-  =M-x yas-load-snippet-buffer-and-close=, key binding: =C-c C-c=
   <<yas-load-snippet-buffer-and-close>>

   Like =yas-load-snippet-buffer=, but also saves the snippet and
   calls =quit-window=.  The destination is decided based on the
   chosen snippet table and snippet collection directly (defaulting to
   the first directory in =yas-snippet-dirs= (see [[file:snippet-organization.org][Organizing Snippets]]
   for more detail on how snippets are organized).

-  =M-x yas-tryout-snippet=, key binding: =C-c C-t=

   When editing a snippet, this opens a new empty buffer, sets it to
   the appropriate major mode and inserts the snippet there, so you
   can see what it looks like.

There are also /snippets for writing snippets/: =vars=, =$f= and =$m=
:-).

* File content

A file defining a snippet generally contains the template to be
expanded.

Optionally, if the file contains a line of =# --=, the lines above it
count as comments, some of which can be /directives/ (or meta data).
Snippet directives look like =# property: value= and tweak certain
snippet properties described below. If no =# --= is found, the whole
file is considered the snippet template.

Here's a typical example:

#+BEGIN_SRC snippet
  # contributor: pluskid <pluskid@gmail.com>
  # name: __...__
  # --
  __${init}__
#+END_SRC

Here's a list of currently supported directives:

** =# key:= snippet abbrev

This is the probably the most important directive, it's the
abbreviation you type to expand a snippet just before hitting the key
that runs [[sym:yas-expand][=yas-expand=]]. If you don't specify this,
the snippet will not be expandable through the trigger mechanism.

** =# name:= snippet name

This is a one-line description of the snippet. It will be displayed in
the menu. It's a good idea to select a descriptive name for a snippet --
especially distinguishable among similar snippets.

If you omit this name, it will default to the file name the snippet
was loaded from.

** =# condition:= snippet condition

This is a piece of Emacs Lisp code. If a snippet has a condition, then
it will only be expanded when the condition code evaluate to some
non-nil value.

See also [[sym:yas-buffer-local-condition][=yas-buffer-local-condition=]] in
[[./snippet-expansion.org][Expanding snippets]]

** =# group:= snippet menu grouping

When expanding/visiting snippets from the menu-bar menu, snippets for a
given mode can be grouped into sub-menus. This is useful if one has too
many snippets for a mode which will make the menu too long.

The =# group:= property only affect menu construction (See
[[./snippet-menu.org][the YASnippet menu]]) and the same effect can be
achieved by grouping snippets into sub-directories and using the
=.yas-make-groups= special file (for this see
[[./snippet-organization.org][Organizing Snippets]]

Refer to the bundled snippets for =ruby-mode= for examples of the
=# group:= directive. Group can also be nested, e.g.
=control structure.loops= indicates that the snippet is under the =loops=
group which is under the =control structure= group.

