new-style/snippet-development.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing snippets</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="stylesheets/manual.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <ul class="center">
    <li> <a href="index.html">Overview</a>
    <li> <a href="https://github.com/joaotavora/yasnippet/blob/master/README.mdown">
        Intro and Tutorial</a>
    <li class="center border">Snippet
      <ul id="snippet-submenu">
        <li> <a href="snippet-organization.html">Organization</a>
        <li> <a href="snippet-expansion.html">Expansion</a>
        <li> <span class='current'>Development</span>
        <li> <a href="snippet-menu.html">Menu</a>
      </ul>
    <li> <a href="faq.html">FAQ</a>
    <li> <a href="snippet-reference.html">Reference</a>
  </ul>
</nav>
</div>
<div id="content">
<h1 class="title">Writing snippets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6796ab7">Snippet development</a>
<ul>
<li><a href="#orgd2c5216">Quickly finding snippets</a></li>
<li><a href="#org4406e2d">Using the <code>snippet-mode</code> major mode </a></li>
</ul>
</li>
<li><a href="#org5e87ae3">File content</a>
<ul>
<li><a href="#org9b062b6"><code># key:</code> snippet abbrev</a></li>
<li><a href="#org592456a"><code># name:</code> snippet name</a></li>
<li><a href="#org185b594"><code># condition:</code> snippet condition</a></li>
<li><a href="#orgd710184"><code># group:</code> snippet menu grouping</a></li>
<li><a href="#orga37203f"><code># expand-env:</code> expand environment</a></li>
<li><a href="#org67f4e69"><code># binding:</code> direct keybinding</a></li>
<li><a href="#org24f6fba"><code># type:</code> <code>snippet</code> or <code>command</code></a></li>
<li><a href="#orgd0516f9"><code># uuid:</code> unique identifier</a></li>
<li><a href="#orge2b38b9"><code># contributor:</code> snippet author</a></li>
</ul>
</li>
<li><a href="#org9801aa7">Template Syntax</a>
<ul>
<li><a href="#org0e7ccf8">Plain Text</a></li>
<li><a href="#orgcde188c">Embedded Emacs-lisp code</a>
<ul>
<li><a href="#org9804f4c">Note: backquote expressions should not modify the buffer</a></li>
</ul>
</li>
<li><a href="#org41a4ac7">Tab stop fields</a></li>
<li><a href="#org844d0b2">Placeholder fields</a></li>
<li><a href="#org087775c">Mirrors </a></li>
<li><a href="#orge2c1f71">Mirrors with transformations </a></li>
<li><a href="#org4efa067">Fields with transformations</a></li>
<li><a href="#org73e1209">Choosing fields value from a list and other tricks</a></li>
<li><a href="#orgca40be6">Nested placeholder fields</a></li>
<li><a href="#org92b7360">Indentation markers</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6796ab7" class="outline-2">
<h2 id="org6796ab7">Snippet development</h2>
<div class="outline-text-2" id="text-org6796ab7">
</div>
<div id="outline-container-orgd2c5216" class="outline-3">
<h3 id="orgd2c5216">Quickly finding snippets</h3>
<div class="outline-text-3" id="text-orgd2c5216">
<p>
There are some ways you can quickly find a snippet file or create a new one:
</p>

<ul class="org-ul">
<li><p>
<code>M-x yas-new-snippet</code>, key bindind: <code>C-c &amp; C-n</code>
</p>

<p>
Creates a new buffer with a template for making a new snippet.  The
buffer is in <code>snippet-mode</code> (see <a href="#orgb9ac10d">below</a>).  When you are done editing
the new snippet, use <a href="#org7f07002"><code>C-c C-c</code></a> to save it.
</p></li>

<li><p>
<code>M-x yas-visit-snippet-file</code>, key binding: <code>C-c &amp; C-v</code>
</p>

<p>
Prompts you for possible snippet expansions like
<a href="snippet-reference.html#yas-insert-snippet"><code>yas-insert-snippet</code></a>, but instead of expanding it, takes you directly
to the snippet definition's file, if it exists.
</p></li>
</ul>

<p>
Once you find this file it will be set to <code>snippet-mode</code> (see <a href="#orgb9ac10d">ahead</a>)
and you can start editing your snippet.
</p>
</div>
</div>

<div id="outline-container-org4406e2d" class="outline-3">
<h3 id="org4406e2d">Using the <code>snippet-mode</code> major mode <a id="orgb9ac10d"></a></h3>
<div class="outline-text-3" id="text-org4406e2d">
<p>
There is a major mode <code>snippet-mode</code> to edit snippets. You can set the
buffer to this mode with <code>M-x snippet-mode</code>. It provides reasonably
useful syntax highlighting.
</p>

<p>
Three commands are defined in this mode:
</p>

<ul class="org-ul">
<li><p>
<code>M-x yas-load-snippet-buffer</code>, key binding: <code>C-c C-l</code>
</p>

<p>
Prompts for a snippet table (with a default based on snippet's
major mode) and loads the snippet currently being edited.
</p></li>

<li><p>
<code>M-x yas-load-snippet-buffer-and-close</code>, key binding: <code>C-c C-c</code>
<a id="org7f07002"></a>
</p>

<p>
Like <code>yas-load-snippet-buffer</code>, but also saves the snippet and
calls <code>quit-window</code>.  The destination is decided based on the
chosen snippet table and snippet collection directly (defaulting to
the first directory in <code>yas-snippet-dirs</code> (see <a href="snippet-organization.html">Organizing Snippets</a>
for more detail on how snippets are organized).
</p></li>

<li><p>
<code>M-x yas-tryout-snippet</code>, key binding: <code>C-c C-t</code>
</p>

<p>
When editing a snippet, this opens a new empty buffer, sets it to
the appropriate major mode and inserts the snippet there, so you
can see what it looks like.
</p></li>
</ul>

<p>
There are also <i>snippets for writing snippets</i>: <code>vars</code>, <code>$f</code> and <code>$m</code>
:-).
</p>
</div>
</div>
</div>

<div id="outline-container-org5e87ae3" class="outline-2">
<h2 id="org5e87ae3">File content</h2>
<div class="outline-text-2" id="text-org5e87ae3">
<p>
A file defining a snippet generally contains the template to be
expanded.
</p>

<p>
Optionally, if the file contains a line of <code># --</code>, the lines above it
count as comments, some of which can be <i>directives</i> (or meta data).
Snippet directives look like <code># property: value</code> and tweak certain
snippets properties described below. If no <code># --</code> is found, the whole
file is considered the snippet template.
</p>

<p>
Here's a typical example:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span class="org-comment"># contributor: pluskid <a href="mailto:pluskid%40gmail.com">&lt;pluskid@gmail.com&gt;</a></span>
<span class="org-comment"># name: __...__</span>
<span class="org-comment"># --</span>
__${init<span class="org-keyword">}</span>__
</pre>
</div>

<p>
Here's a list of currently supported directives:
</p>
</div>

<div id="outline-container-org9b062b6" class="outline-3">
<h3 id="org9b062b6"><code># key:</code> snippet abbrev</h3>
<div class="outline-text-3" id="text-org9b062b6">
<p>
This is the probably the most important directive, it's the
abbreviation you type to expand a snippet just before hitting the key
that runs <a href="snippet-reference.html#yas-expand"><code>yas-expand</code></a>. If you don't specify this,
the snippet will not be expandable through the trigger mechanism.
</p>
</div>
</div>

<div id="outline-container-org592456a" class="outline-3">
<h3 id="org592456a"><code># name:</code> snippet name</h3>
<div class="outline-text-3" id="text-org592456a">
<p>
This is a one-line description of the snippet. It will be displayed in
the menu. It's a good idea to select a descriptive name for a snippet &#x2013;
especially distinguishable among similar snippets.
</p>

<p>
If you omit this name, it will default to the file name the snippet
was loaded from.
</p>
</div>
</div>

<div id="outline-container-org185b594" class="outline-3">
<h3 id="org185b594"><code># condition:</code> snippet condition</h3>
<div class="outline-text-3" id="text-org185b594">
<p>
This is a piece of Emacs-lisp code. If a snippet has a condition, then
it will only be expanded when the condition code evaluate to some
non-nil value.
</p>

<p>
See also <a href="snippet-reference.html#yas-buffer-local-condition"><code>yas-buffer-local-condition</code></a> in
<a href="./snippet-expansion.html">Expanding snippets</a>
</p>
</div>
</div>

<div id="outline-container-orgd710184" class="outline-3">
<h3 id="orgd710184"><code># group:</code> snippet menu grouping</h3>
<div class="outline-text-3" id="text-orgd710184">
<p>
When expanding/visiting snippets from the menu-bar menu, snippets for a
given mode can be grouped into sub-menus . This is useful if one has too
many snippets for a mode which will make the menu too long.
</p>

<p>
The <code># group:</code> property only affect menu construction (See
<a href="./snippet-menu.html">the YASnippet menu</a>) and the same effect can be
achieved by grouping snippets into sub-directories and using the
<code>.yas-make-groups</code> special file (for this see
<a href="./snippet-organization.html">Organizing Snippets</a>
</p>

<p>
Refer to the bundled snippets for <code>ruby-mode</code> for examples on the
<code># group:</code> directive. Group can also be nested, e.g.
<code>control structure.loops</code> tells that the snippet is under the <code>loops</code>
group which is under the <code>control structure</code> group.
</p>
</div>
</div>
