doc/snippet-development.org
** =# expand-env:= expand environment

This is another piece of Emacs Lisp code in the form of a =let= /varlist
form/, i.e. a list of lists assigning values to variables. It can be
used to override variable values while the snippet is being expanded.

Interesting variables to override are [[sym:yas-wrap-around-region][=yas-wrap-around-region=]] and
[[sym:yas-indent-line][=yas-indent-line=]] (see [[./snippet-expansion.org][Expanding Snippets]]).

As an example, you might normally have [[sym:yas-indent-line][=yas-indent-line=]] set to '=auto=
and [[sym:yas-wrap-around-region][=yas-wrap-around-region=]] set to =t=, but for this particularly
brilliant piece of ASCII art these values would mess up your hard work.
You can then use:

#+BEGIN_SRC snippet
  # name: ASCII home
  # expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 'nil))
  # --
                  welcome to my
              X      humble
             / \      home,
            /   \      $0
           /     \
          /-------\
          |       |
          |  +-+  |
          |  | |  |
          +--+-+--+
#+END_SRC

** =# binding:= direct keybinding

You can use this directive to expand a snippet directly from a normal
Emacs keybinding. The keybinding will be registered in the Emacs keymap
named after the major mode the snippet is active for.

Additionally a variable [[sym:yas-prefix][=yas-prefix=]] is set to the prefix argument
you normally use for a command. This allows for small variations on the
same snippet, for example in this =html-mode= snippet.

#+BEGIN_SRC snippet
  # name: <p>...</p>
  # binding: C-c C-c C-m
  # --
  <p>`(when yas-prefix "\n")`$0`(when yas-prefix "\n")`</p>
#+END_SRC

This binding will be recorded in the keymap =html-mode-map=. To expand a
paragraph tag newlines, just press =C-u C-c C-c C-m=. Omitting the =C-u=
will expand the paragraph tag without newlines.

** =# type:= =snippet= or =command=

If the =type= directive is set to =command=, the body of the snippet
is interpreted as Lisp code to be evaluated when the snippet is
triggered.

If it's =snippet= (the default when there is no =type= directive), the
snippet body will be parsed according to the [[Template Syntax]],
described below.

** =# uuid:= unique identifier

This provides to a way to identify a snippet, independent of its name.
Loading a second snippet file with the same uuid would replace the
previous snippet.

** =# contributor:= snippet author

This is optional and has no effect whatsoever on snippet functionality,
but it looks nice.

* Template Syntax

The syntax of the snippet template is simple but powerful, very similar
to TextMate's.

** Plain Text

Arbitrary text can be included as the content of a template. They are
usually interpreted as plain text, except =$= and =`=. You need to
use =\= to escape them: =\$= and =\`=. The =\= itself may also needed to be
escaped as =\\= sometimes.

** Embedded Emacs Lisp code

Emacs Lisp code can be embedded inside the template, written inside
back-quotes (=`=). The Lisp forms are evaluated when the snippet is
being expanded. The evaluation is done in the same buffer as the
snippet being expanded.

Here's an example for =c-mode= to calculate the header file guard
dynamically:

#+BEGIN_SRC snippet
  #ifndef ${1:_`(upcase (file-name-nondirectory (file-name-sans-extension (buffer-file-name))))`_H_}
  #define $1

  $0

  #endif /* $1 */
#+END_SRC

From version 0.6, snippet expansions are run with some special
Emacs Lisp variables bound. One of these is [[sym:yas-selected-text][=yas-selected-text=]]. You can
therefore define a snippet like:

#+BEGIN_SRC snippet
  for ($1;$2;$3) {
    `yas-selected-text`$0
  }
#+END_SRC

to "wrap" the selected region inside your recently inserted snippet.
Alternatively, you can also customize the variable
[[sym:yas-wrap-around-region][=yas-wrap-around-region=]] to =t= which will do this automatically.

*** Note: backquote expressions should not modify the buffer

Please note that the Lisp forms in backquotes should *not* modify the
buffer, doing so will trigger a warning.  For example, instead of
doing

#+BEGIN_SRC snippet
  Timestamp: `(insert (current-time-string))`
#+END_SRC

do this:
#+BEGIN_SRC snippet
  Timestamp: `(current-time-string)`
#+END_SRC

The warning may be suppressed with the following code in your init file:
#+BEGIN_SRC emacs-lisp
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change))
#+END_SRC


** Tab stop fields

Tab stops are fields that you can navigate back and forth by =TAB= and
=S-TAB=. They are written by =$= followed with a number. =$0= has the
special meaning of the /exit point/ of a snippet. That is the last place
to go when you've traveled all the fields. Here's a typical example:

#+BEGIN_SRC snippet
  <div$1>
      $0
  </div>
#+END_SRC
** Placeholder fields

Tab stops can have default values -- a.k.a placeholders. The syntax is
like this:

#+BEGIN_SRC snippet
  ${N:default value}
#+END_SRC

They act as the default value for a tab stop. But when you first
type at a tab stop, the default value will be replaced by your typing.
The number can be omitted if you don't want to create [[mirrors-fields][mirrors]] or
[[mirror-transformations][transformations]] for this field.

