new-style/snippet-development.html

<div id="outline-container-orga37203f" class="outline-3">
<h3 id="orga37203f"><code># expand-env:</code> expand environment</h3>
<div class="outline-text-3" id="text-orga37203f">
<p>
This is another piece of Emacs-lisp code in the form of a <code>let</code> <i>varlist
form</i>, i.e. a list of lists assigning values to variables. It can be
used to override variable values while the snippet is being expanded.
</p>

<p>
Interesting variables to override are <a href="snippet-reference.html#yas-wrap-around-region"><code>yas-wrap-around-region</code></a> and
<a href="snippet-reference.html#yas-indent-line"><code>yas-indent-line</code></a> (see <a href="./snippet-expansion.html">Expanding Snippets</a>).
</p>

<p>
As an example, you might normally have <a href="snippet-reference.html#yas-indent-line"><code>yas-indent-line</code></a> set to '<code>auto</code>
and <a href="snippet-reference.html#yas-wrap-around-region"><code>yas-wrap-around-region</code></a> set to <code>t</code>, but for this particularly
brilliant piece of ASCII art these values would mess up your hard work.
You can then use:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span class="org-comment"># name: ASCII home</span>
<span class="org-comment"># expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 'nil))</span>
<span class="org-comment"># --</span>
                welcome to my
            X      humble
           / \      home,
          /   \      <span class="org-keyword">$</span><span class="org-string">0</span>
         /     \
        /-------\
        |       |
        |  +-+  |
        |  | |  |
        +--+-+--+
</pre>
</div>
</div>
</div>

<div id="outline-container-org67f4e69" class="outline-3">
<h3 id="org67f4e69"><code># binding:</code> direct keybinding</h3>
<div class="outline-text-3" id="text-org67f4e69">
<p>
You can use this directive to expand a snippet directly from a normal
Emacs keybinding. The keybinding will be registered in the Emacs keymap
named after the major mode the snippet is active for.
</p>

<p>
Additionally a variable <a href="snippet-reference.html#yas-prefix"><code>yas-prefix</code></a> is set to to the prefix argument
you normally use for a command. This allows for small variations on the
same snippet, for example in this "html-mode" snippet.
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span class="org-comment"># name: &lt;p&gt;...&lt;/p&gt;</span>
<span class="org-comment"># binding: C-c C-c C-m</span>
<span class="org-comment"># --</span>
&lt;p&gt;`(<span class="org-keyword">when</span> yas-prefix <span class="org-string">"\n"</span>)`<span class="org-keyword">$</span><span class="org-string">0</span>`(<span class="org-keyword">when</span> yas-prefix <span class="org-string">"\n"</span>)`&lt;/p&gt;
</pre>
</div>

<p>
This binding will be recorded in the keymap <code>html-mode-map</code>. To expand a
paragraph tag newlines, just press <code>C-u C-c C-c C-m</code>. Omitting the <code>C-u</code>
will expand the paragraph tag without newlines.
</p>
</div>
</div>

<div id="outline-container-org24f6fba" class="outline-3">
<h3 id="org24f6fba"><code># type:</code> <code>snippet</code> or <code>command</code></h3>
<div class="outline-text-3" id="text-org24f6fba">
<p>
If the <code>type</code> directive is set to <code>command</code>, the body of the snippet
is interpreted as lisp code to be evaluated when the snippet is
triggered.
</p>

<p>
If it's <code>snippet</code> (the default when there is no <code>type</code> directive), the
snippet body will be parsed according to the <a href="#org9801aa7">Template Syntax</a>,
described below.
</p>
</div>
</div>

<div id="outline-container-orgd0516f9" class="outline-3">
<h3 id="orgd0516f9"><code># uuid:</code> unique identifier</h3>
<div class="outline-text-3" id="text-orgd0516f9">
<p>
This provides to a way to identify a snippet, independent of its name.
Loading a second snippet file with the same uuid would replace the
previous snippet.
</p>
</div>
</div>

<div id="outline-container-orge2b38b9" class="outline-3">
<h3 id="orge2b38b9"><code># contributor:</code> snippet author</h3>
<div class="outline-text-3" id="text-orge2b38b9">
<p>
This is optional and has no effect whatsoever on snippet functionality,
but it looks nice.
</p>
</div>
</div>
</div>

<div id="outline-container-org9801aa7" class="outline-2">
<h2 id="org9801aa7">Template Syntax</h2>
<div class="outline-text-2" id="text-org9801aa7">
<p>
The syntax of the snippet template is simple but powerful, very similar
to TextMate's.
</p>
</div>

<div id="outline-container-org0e7ccf8" class="outline-3">
<h3 id="org0e7ccf8">Plain Text</h3>
<div class="outline-text-3" id="text-org0e7ccf8">
<p>
Arbitrary text can be included as the content of a template. They are
usually interpreted as plain text, except <code>$</code> and <code>`</code>. You need to
use <code>\</code> to escape them: <code>\$</code> and <code>\`</code>. The <code>\</code> itself may also needed to be
escaped as <code>\\</code> sometimes.
</p>
</div>
</div>

<div id="outline-container-orgcde188c" class="outline-3">
<h3 id="orgcde188c">Embedded Emacs-lisp code</h3>
<div class="outline-text-3" id="text-orgcde188c">
<p>
Emacs-Lisp code can be embedded inside the template, written inside
back-quotes (<code>`</code>). The lisp forms are evaluated when the snippet is
being expanded. The evaluation is done in the same buffer as the
snippet being expanded.
</p>

<p>
Here's an example for c-mode to calculate the header file guard
dynamically:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span class="org-comment">#ifndef ${</span><span class="org-warning">1</span><span class="org-comment">:_`(upcase (file-name-nondirectory (file-name-sans-extension (buffer-file-name))))`_H_}</span>
<span class="org-comment">#define $</span><span class="org-string">1</span>

<span class="org-keyword">$</span><span class="org-string">0</span>

<span class="org-comment">#endif /* $</span><span class="org-string">1</span><span class="org-comment"> */</span>
</pre>
</div>

<p>
From version 0.6, snippets expansions are run with some special
Emacs-lisp variables bound. One of this is <a href="snippet-reference.html#yas-selected-text"><code>yas-selected-text</code></a>. You can
therefore define a snippet like:
</p>

<div class="org-src-container">
<pre class="src src-snippet">for (<span class="org-keyword">$</span><span class="org-string">1</span>;<span class="org-keyword">$</span><span class="org-string">2</span>;<span class="org-keyword">$</span><span class="org-string">3</span>) {
  `yas-selected-text`<span class="org-keyword">$</span><span class="org-string">0</span>
<span class="org-keyword">}</span>
</pre>
</div>

<p>
to "wrap" the selected region inside your recently inserted snippet.
Alternatively, you can also customize the variable
<a href="snippet-reference.html#yas-wrap-around-region"><code>yas-wrap-around-region</code></a> to <code>t</code> which will do this automatically.
</p>
</div>

<div id="outline-container-org9804f4c" class="outline-4">
<h4 id="org9804f4c">Note: backquote expressions should not modify the buffer</h4>
<div class="outline-text-4" id="text-org9804f4c">
<p>
Please note that the lisp forms in backquotes should <b>not</b> modify the
buffer, doing so will trigger a warning.  For example, instead of
doing
</p>

<div class="org-src-container">
<pre class="src src-snippet">Timestamp: `(insert (current-time-string))`
</pre>
</div>

<p>
do this:
</p>
<div class="org-src-container">
<pre class="src src-snippet">Timestamp: `(current-time-string)`
</pre>
</div>

<p>
The warning may be suppressed with the following code in your init file:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'warning-suppress-types '(yasnippet backquote-change))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org41a4ac7" class="outline-3">
<h3 id="org41a4ac7">Tab stop fields</h3>
<div class="outline-text-3" id="text-org41a4ac7">
<p>
Tab stops are fields that you can navigate back and forth by <code>TAB</code> and
<code>S-TAB</code>. They are written by <code>$</code> followed with a number. <code>$0</code> has the
special meaning of the <i>exit point</i> of a snippet. That is the last place
to go when you've traveled all the fields. Here's a typical example:
</p>

<div class="org-src-container">
<pre class="src src-snippet">&lt;div<span class="org-keyword">$</span><span class="org-string">1</span>&gt;
    <span class="org-keyword">$</span><span class="org-string">0</span>
&lt;/div&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org844d0b2" class="outline-3">
<h3 id="org844d0b2">Placeholder fields</h3>
<div class="outline-text-3" id="text-org844d0b2">
<p>
Tab stops can have default values &#x2013; a.k.a placeholders. The syntax is
like this:
</p>

<div class="org-src-container">
<pre class="src src-snippet">${N:default value<span class="org-keyword">}</span>
</pre>
</div>

<p>
They act as the default value for a tab stop. But when you first
type at a tab stop, the default value will be replaced by your typing.
The number can be omitted if you don't want to create <a href="#orge0a8493">mirrors</a> or
<a href="#org6c77fba">transformations</a> for this field.
</p>
</div>
</div>
