new-style/snippet-development.html

<div id="outline-container-org087775c" class="outline-3">
<h3 id="org087775c">Mirrors <a id="orge0a8493"></a></h3>
<div class="outline-text-3" id="text-org087775c">
<p>
We refer the tab stops with placeholders as a <i>field</i>. A field can have
mirrors. Its mirrors will get updated when you change the text of a
field. Here's an example:
</p>

<div class="org-src-container">
<pre class="src src-snippet">\begin{<span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span>enumerate<span class="org-keyword">}}</span>
    <span class="org-keyword">$</span><span class="org-string">0</span>
\end{<span class="org-keyword">$</span><span class="org-string">1</span><span class="org-keyword">}</span>
</pre>
</div>

<p>
When you type "document" at <code>${1:enumerate}</code>, the word "document" will
also be inserted at <code>\end{$1}</code>. The best explanation is to see the
screencast(<a href="http://www.youtube.com/watch?v=vOj7btx3ATg">YouTube</a> or <a href="http://yasnippet.googlecode.com/files/yasnippet.avi">avi video</a>).
</p>

<p>
The tab stops with the same number to the field act as its mirrors. If
none of the tab stops has an initial value, the first one is selected as
the field and others mirrors.
</p>
</div>
</div>

<div id="outline-container-orge2c1f71" class="outline-3">
<h3 id="orge2c1f71">Mirrors with transformations <a id="org6c77fba"></a></h3>
<div class="outline-text-3" id="text-orge2c1f71">
<p>
If the value of an <code>${n:</code>-construct starts with and contains <code>$(</code>,
then it is interpreted as a mirror for field <code>n</code> with a
transformation. The mirror's text content is calculated according to
this transformation, which is Emacs-lisp code that gets evaluated in
an environment where the variable <a href="snippet-reference.html#yas-text"><code>yas-text</code></a> is bound to the text
content (string) contained in the field <code>n</code>. Here's an example for
Objective-C:
</p>

<div class="org-src-container">
<pre class="src src-snippet">- (<span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span>id<span class="org-keyword">}</span>)<span class="org-keyword">${</span><span class="org-warning">2</span><span class="org-keyword">:</span>foo<span class="org-keyword">}</span>
{
    return <span class="org-keyword">$</span><span class="org-string">2</span>;
<span class="org-keyword">}</span>

- (void)set<span class="org-keyword">${</span><span class="org-warning">2</span><span class="org-keyword">:</span><span class="org-preprocessor">$(</span>capitalize yas-text)<span class="org-keyword">}</span>:(<span class="org-keyword">$</span><span class="org-string">1</span>)aValue
{
    [<span class="org-keyword">$</span><span class="org-string">2</span> autorelease];
    <span class="org-keyword">$</span><span class="org-string">2</span> = [aValue retain];
<span class="org-keyword">}</span>
<span class="org-keyword">$</span><span class="org-string">0</span>
</pre>
</div>

<p>
Look at <code>${2:$(capitalize yas-text)}</code>, it is a mirror with
transformation instead of a field. The actual field is at the first
line: <code>${2:foo}</code>. When you type text in <code>${2:foo}</code>, the transformation
will be evaluated and the result will be placed there as the
transformed text. So in this example, if you type "baz" in the field,
the transformed text will be "Baz". This example is also available in
the screencast.
</p>

<p>
Another example is for <code>rst-mode</code>. In reStructuredText, the document
title can be some text surrounded by "<code>=</code>" below and above. The "<code>=</code>"
should be at least as long as the text. So
</p>

<div class="org-src-container">
<pre class="src src-rst"><span class="org-rst-adornment">=====</span>
<span class="org-rst-level-1">Title</span>
<span class="org-rst-adornment">=====</span>
</pre>
</div>

<p>
is a valid title but
</p>

<div class="org-src-container">
<pre class="src src-rst"><span class="org-rst-adornment">===</span>
<span class="org-rst-level-1">Title</span>
<span class="org-rst-adornment">===</span>
</pre>
</div>

<p>
is not. Here's an snippet for rst title:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span><span class="org-preprocessor">$(</span>make-string (string-width yas-text) ?\=)<span class="org-keyword">}</span>
<span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span>Title<span class="org-keyword">}</span>
<span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span><span class="org-preprocessor">$(</span>make-string (string-width yas-text) ?\=)<span class="org-keyword">}</span>

<span class="org-keyword">$</span><span class="org-string">0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4efa067" class="outline-3">
<h3 id="org4efa067">Fields with transformations</h3>
<div class="outline-text-3" id="text-org4efa067">
<p>
From version 0.6 on, you can also have lisp transformation inside
fields. These work mostly like mirror transformations. However, they
are evaluated when you first enter the field, after each change you
make to the field and also just before you exit the field.
</p>

<p>
The syntax is also a tiny bit different, so that the parser can
distinguish between fields and mirrors. In the following example
</p>

<pre class="example">
#define "${1:mydefine$(upcase yas-text)}"

</pre>

<p>
<code>mydefine</code> gets automatically upcased to <code>MYDEFINE</code> once you enter the
field. As you type text, it gets filtered through the transformation
every time.
</p>

<p>
Note that to tell this kind of expression from a mirror with a
transformation, YASnippet needs extra text between the <code>:</code> and the
transformation's <code>$</code>. If you don't want this extra-text, you can use two
<code>$</code>'s instead.
</p>

<pre class="example">
#define "${1:$$(upcase yas-text)}"

</pre>

<p>
Please note that as soon as a transformation takes place, it changes the
value of the field and sets it its internal modification state to
<code>true</code>. As a consequence, the auto-deletion behaviour of normal fields
does not take place. This is by design.
</p>
</div>
</div>

<div id="outline-container-org73e1209" class="outline-3">
<h3 id="org73e1209">Choosing fields value from a list and other tricks</h3>
<div class="outline-text-3" id="text-org73e1209">
<p>
As mentioned, the field transformation is invoked just after you enter
the field, and with some useful variables bound, notably
<a href="snippet-reference.html#yas-modified-p"><code>yas-modified-p</code></a> and <a href="snippet-reference.html#yas-moving-away-p"><code>yas-moving-away-p</code></a>. Because of this feature you
can place a transformation in the primary field that lets you select
default values for it.
</p>

<p>
The <a href="snippet-reference.html#yas-choose-value"><code>yas-choose-value</code></a> does this work for you. For example:
</p>

<div class="org-src-container">
<pre class="src src-snippet">&lt;div align=<span class="org-string">"${</span><span class="org-warning">2</span><span class="org-string">:$$(yas-choose-value '("</span>right<span class="org-string">" "</span>center<span class="org-string">" "</span>left<span class="org-string">"))}"</span>&gt;
  <span class="org-keyword">$</span><span class="org-string">0</span>
&lt;/div&gt;
</pre>
</div>

<p>
See the definition of <a href="snippet-reference.html#yas-choose-value"><code>yas-choose-value</code></a> to see how it was written using
the two variables.
</p>

<p>
Here's another use, for LaTeX-mode, which calls reftex-label just as you
enter snippet field 2. This one makes use of <a href="snippet-reference.html#yas-modified-p"><code>yas-modified-p</code></a> directly.
</p>

<div class="org-src-container">
<pre class="src src-snippet">\section{<span class="org-keyword">${</span><span class="org-warning">1</span><span class="org-keyword">:</span><span class="org-string">"Titel der Tour"</span><span class="org-keyword">}}</span>%
\index{<span class="org-keyword">$</span><span class="org-string">1</span><span class="org-keyword">}</span>%
\label{{2:<span class="org-string">"waiting for reftex-label call..."</span><span class="org-preprocessor">$(</span><span class="org-keyword">unless</span> yas-modified-p (reftex-label nil 'dont-
insert))<span class="org-keyword">}}</span>%
</pre>
</div>

<p>
The function <a href="snippet-reference.html#yas-verify-value"><code>yas-verify-value</code></a> has another neat trick, and makes use
of <a href="snippet-reference.html#yas-moving-away-p"><code>yas-moving-away-p</code></a>. Try it and see! Also, check out this <a href="http://groups.google.com/group/smart-snippet/browse_thread/thread/282a90a118e1b662">thread</a>
</p>
</div>
</div>
